<a href="https://colab.research.google.com/github/Th3Mayar/project_parcial_python/blob/main/final_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Examen o Proyecto (1) Python - 20220115**

## *Imports* libraries

In [ ]:
import pandas as pd
import numpy as np

## Problema 1: Análisis de Ventas de un Supermercado

In [ ]:
# Load data from the CSV file
df_sales = pd.read_csv('/content/data_used/ventas_supermercado.csv')

# Convert the 'Date' column to datetime format
df_sales['Fecha'] = pd.to_datetime(df_sales['Fecha'])

# 1. Add a new column 'Total Sale'
df_sales['Total Sale'] = df_sales['Cantidad'] * df_sales['Precio'] - df_sales['Descuento']

# 2. Calculate total sales by product and sort them in descending order
total_sales = df_sales.groupby('Producto')['Total Sale'].sum().sort_values(ascending=False)
print("Total sales by product:")
print(total_sales)

# 3. Filter sales made in the month of March
march_sales = df_sales[df_sales['Fecha'].dt.month == 3]
print("\nSales in the month of March:")
print(march_sales)

# 4. Generate a NumPy array with total sales in March by product
march_total_sales = march_sales.groupby('Producto')['Total Sale'].sum()
march_sales_array = np.array(march_total_sales)
print("\nArray of total sales in March:", march_sales_array)

# 5. Calculate the average sales in March
march_sales_avg = np.mean(march_sales_array)
print("Average sales in March:", march_sales_avg)

# Style the total sales table highlighting the highest and lowest values
styled_sales = df_sales.style.highlight_max(subset=['Total Sale'], color='lightgreen')\
                               .highlight_min(subset=['Total Sale'], color='lightcoral')
styled_sales

Total sales by product:
Producto
Naranja    45.0
Manzana    43.2
Pera       14.2
Banana      7.0
Name: Total Sale, dtype: float64

Sales in the month of March:
       Fecha Producto  Cantidad  Precio  Descuento  Total Sale
0 2024-03-01  Manzana        10     2.5        1.0        24.0
1 2024-03-05   Banana         5     1.5        0.5         7.0
3 2024-03-15     Pera         7     2.2        1.2        14.2
4 2024-03-20  Manzana         8     2.5        0.8        19.2

Array of total sales in March: [ 7.  43.2 14.2]
Average sales in March: 21.46666666666667

## Problema 2: Análisis de Rendimiento Académico

In [ ]:
# Load data from the CSV file
df_students = pd.read_csv('/content/data_used/calificaciones_estudiantes.csv')

# 1. Add a column "Average" with the average of the three grades
df_students['Average'] = df_students[['Matemáticas', 'Ciencias', 'Historia']].mean(axis=1)

# 2. Assign "Passed" or "Failed" in a new column called "Status"
df_students['Status'] = np.where(df_students['Average'] >= 60, 'Passed', 'Failed')

# 3. Count how many students have passed and how many have failed
passed_students = (df_students['Status'] == 'Passed').sum()
failed_students = (df_students['Status'] == 'Failed').sum()
print(f"Passed students: {passed_students}, Failed students: {failed_students}")

# 4. Filter students who passed all subjects with grades >= 70
passed_all = df_students[
    (df_students['Matemáticas'] >= 70) &
    (df_students['Ciencias'] >= 70) &
    (df_students['Historia'] >= 70)
]
print("\nStudents who passed all subjects with >= 70 in each one:")
print(passed_all)

# Style the student table highlighting "Passed" in green and "Failed" in red
styled_students = df_students.style.applymap(lambda x: 'background-color: lightgreen' if x == 'Passed' else 'background-color: lightcoral', subset=['Status'])
styled_students

Passed students: 4, Failed students: 1

Students who passed all subjects with >= 70 in each one:
  Nombre  Matemáticas  Ciencias  Historia    Average  Status
0    Ana           85        90        88  87.666667  Passed
4  Pedro           95        80        90  88.333333  Passed

<ipython-input-29-e51f90872473>:25: FutureWarning: Styler.applymap has been deprecated. Use Styler.map instead.
  styled_students = df_students.style.applymap(lambda x: 'background-color: lightgreen' if x == 'Passed' else 'background-color: lightcoral', subset=['Status'])

## Problema 3: Simulación de Inventario de una Tienda

In [ ]:
# Load data from the CSV file
df_inventory = pd.read_csv('/content/data_used/inventario_tienda.csv')

# 1. Create a new column 'Total Value in Inventory'
df_inventory['Total Value in Inventory'] = df_inventory['Cantidad'] * df_inventory['Precio unitario']

# 2. Generate a NumPy array with the total values in inventory
inventory_value_array = np.array(df_inventory['Total Value in Inventory'])
print("Array of total values in inventory:", inventory_value_array)

# 3. Calculate the cost of restocking products with quantity less than 20
df_inventory['Restocking Cost'] = np.where(df_inventory['Cantidad'] < 20,
                                           (50 - df_inventory['Cantidad']) * df_inventory['Costo de reabastecimiento'],
                                           0)

# 4. Filter products that need restocking and sort them by restocking cost
products_to_restock = df_inventory[df_inventory['Cantidad'] < 20].sort_values(by='Restocking Cost', ascending=False)
print("\nProducts that need restocking:")
print(products_to_restock)

# Style the inventory table, highlighting products with low inventory (<20) and formatting columns as currency
styled_inventory = df_inventory.style.format({
    'Total Value in Inventory': '${:,.2f}',
    'Restocking Cost': '${:,.2f}'
}).highlight_min(subset=['Cantidad'], color='lightcoral', axis=0)
styled_inventory

Array of total values in inventory: [25000  5000  5400  7000  2500]

Products that need restocking:
  Producto  Cantidad  Precio unitario  Costo de reabastecimiento  \
1  Celular        10              500                        450
2   Tablet        18              300                        270

   Total Value in Inventory  Restocking Cost
1                      5000            18000
2                      5400             8640